# Friction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Friction Property
DuctPressureDropData Class See Also
---
The friction of the duct. Units: (kg/(ft²·s²)).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Friction { get; set; }
```

Visual Basic
---
```text
Public Property Friction As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Friction {
	double get ();
	void set (double value);
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace